In [1]:
import pandas as pd
import numpy as np

Pandas 53: Membuat Kategori Baru Berdasarkan Thresold

In [2]:
d = {'hobi':['jogging', 'mancing', 'renang',
             'mancing', 'mancing', 'baca', 
             'baca', 'mancing', 'fotograsi', 
             'mancing', 'camping']}

df = pd.DataFrame(d)
df

         hobi
0     jogging
1     mancing
2      renang
3     mancing
4     mancing
5        baca
6        baca
7     mancing
8   fotograsi
9     mancing
10    camping

In [3]:
df['hobi'].value_counts()#Jumlah baris untuk setiap kemunculan hobi

mancing      5
baca         2
jogging      1
renang       1
fotograsi    1
camping      1
Name: hobi, dtype: int64

In [4]:
persentase = df['hobi'].value_counts(normalize=True)#untuk menampilkan presentase tiap kemunculan hobi tambahkan parameter normalize=True pada .df['hobi'].value_counts()
persentase

mancing      0.454545
baca         0.181818
jogging      0.090909
renang       0.090909
fotograsi    0.090909
camping      0.090909
Name: hobi, dtype: float64

In [5]:
threshold = 0.1#batas nilai 10%
hobi_lain = persentase[persentase < threshold].index#meringkas habi yang nilainya kurang dari 10% ke variabel hobi_lain. .index untuk menampilkan hobinya bukan berupa series presentase kemunculan hobi
hobi_lain

Index(['jogging', 'renang', 'fotograsi', 'camping'], dtype='object')

In [6]:
df['hobi'] = df['hobi'].replace(hobi_lain, 'lainnya')#semua kemunculan hobi pada variabel hobi_lain akan diganti dengan 'lainnya'
df['hobi']

0     lainnya
1     mancing
2     lainnya
3     mancing
4     mancing
5        baca
6        baca
7     mancing
8     lainnya
9     mancing
10    lainnya
Name: hobi, dtype: object

In [7]:
df['hobi'].value_counts(normalize=True)#mengitung presentase tiap hobi yang tersisa di dictionary hobi.
#Di bidang data science sering digunakan ketiap terdapat kategori-kategori yang kecil dan ingin diringkas menjadi kategori yang besar diberi label 'others' atau 'lainnya'

mancing    0.454545
lainnya    0.363636
baca       0.181818
Name: hobi, dtype: float64

Pandas 55: Menyimpan Data Frame sebagai file CSV

In [9]:
data = {'nama': ['bayu', 'indra', 'devi', 'agni'],
       'jenis_kelamin': ['L', 'L', 'P', 'L'],
       'usia': [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

In [10]:
#Menyimpan DataFrame sebagai File CSV: df.to_csv('nama file.csv') 
df.to_csv('data_peserta.csv')

In [14]:
#membaca file csv
#df = pd.read_csv('data_peserta.csv')
df = pd.read_csv('data_peserta.csv', index_col=0)#index_col=0 untuk mengidentifikasikan kolom 0 sebagai index

df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

#menyimpan file csv dengan tidak menyertakan index dengan index=False
df.to_csv('data_peserta.csv', index=False)
df = pd.read_csv('data_peserta.csv')
df

Pandas 55: Menghitung Jumlah Baris Menurut Kriteria Tertentu

In [16]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), columns=cols)
df

   A  B  C  D  E
0  9  1  4  6  3
1  5  4  1  3  4
2  8  6  2  2  2
3  9  2  8  2  6
4  7  8  6  4  8
5  4  8  3  3  9
6  3  7  4  2  7
7  4  2  4  7  6
8  3  7  7  1  3
9  4  5  7  2  5

In [19]:
#Menghitung jumlah baris menurut kriteria tertentu/absolut
(df['A'] < 5).sum()

5

In [20]:
#Menghitung proporsi terhadap keseluruhan data frame/proporsional
(df['A'] < 5).mean()

0.5

Pandas 56: Mengeluarkan Kolom dari Data Frame dengan Pop

In [21]:
data = {'nama': ['bayu', 'indra', 'devi', 'agni'],
       'jenis_kelamin': ['L', 'L', 'P', 'L'],
       'usia': [23, 21, 22, 25]}

df = pd.DataFrame(data)
df

    nama jenis_kelamin  usia
0   bayu             L    23
1  indra             L    21
2   devi             P    22
3   agni             L    25

In [22]:
#Mengeluarkan tabel suatu kolom ke dalam variabel yang terpisah dengan pop
usia = df.pop('usia').to_frame()#menggunakan method .to_frame() karena df.pop('nama variabel baru') merupakan tipe data series

In [23]:
df

    nama jenis_kelamin
0   bayu             L
1  indra             L
2   devi             P
3   agni             L

In [24]:
usia

   usia
0    23
1    21
2    22
3    25